## Staging: database-tools
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 7 to add, 1 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.database-tools will be created
  + resource "aws_db_instance" "database-tools" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "database-tools-rds-subnet"
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + endpoint                              = (known after apply)
      + engine                                = "postgresql"
      + engine_version                        = "14.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "database_tools"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "",
        ]
    }

  # aws_db_subnet_group.database-tools-rds-subnet will be created
  + resource "aws_db_subnet_group" "database-tools-rds-subnet" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "database-tools-rds-subnet"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-001e585d12cce4d1e",
        ]
      + tags        = {
          + "Name" = "My DB subnet group"
        }
      + tags_all    = {
          + "Name" = "My DB subnet group"
        }
    }

  # aws_ecs_service.blazer will be updated in-place
  ~ resource "aws_ecs_service" "blazer" {
        id                                 = "arn:aws:ecs:ca-central-1:239043911459:service/blazer/blazer"
        name                               = "blazer"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:3" -> (known after apply)
        # (14 unchanged attributes hidden)



      ~ network_configuration {
          ~ security_groups  = [
              + "",
              - "sg-07ef3ef90b613aea1",
            ]
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.blazer must be replaced
-/+ resource "aws_ecs_task_definition" "blazer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "ankane/blazer:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "blazer"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "blazer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "blazer"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "blazer" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_execution_role_policy will be destroyed
  # (because aws_iam_policy.blazer_execution_role_policy is not in configuration)
  - resource "aws_iam_policy" "blazer_execution_role_policy" {
      - arn       = "arn:aws:iam::239043911459:policy/blazer_execution_role_policy" -> null
      - id        = "arn:aws:iam::239043911459:policy/blazer_execution_role_policy" -> null
      - name      = "blazer_execution_role_policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4R4D5Q75VOI" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_policy.blazer_task_role_policy will be created
  + resource "aws_iam_policy" "blazer_task_role_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "blazer_task_role_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.blazer_execution_role_actions will be destroyed
  # (because aws_iam_role_policy_attachment.blazer_execution_role_actions is not in configuration)
  - resource "aws_iam_role_policy_attachment" "blazer_execution_role_actions" {
      - id         = "blazer_execution_role-20221014152515199500000002" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/blazer_execution_role_policy" -> null
      - role       = "blazer_execution_role" -> null
    }

  # aws_iam_role_policy_attachment.blazer_task_role_actions will be created
  + resource "aws_iam_role_policy_attachment" "blazer_task_role_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blazer-ecs-task"
    }

  # aws_security_group.blazer will be destroyed
  # (because aws_security_group.blazer is not in configuration)
  - resource "aws_security_group" "blazer" {
      - arn                    = "arn:aws:ec2:ca-central-1:239043911459:security-group/sg-07ef3ef90b613aea1" -> null
      - description            = "Allow inbound traffic to internal service" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Access to internet"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/24",
                ]
              - description      = "Traffic to ECS cluster"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "10.0.1.0/24",
                ]
              - description      = "Traffic to ECS cluster"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "10.0.2.0/24",
                ]
              - description      = "Traffic to ECS cluster"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = "clickops"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0e2c3ef6c5c75b74c",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - id                     = "sg-07ef3ef90b613aea1" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Access to internal service"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 8080
            },
        ] -> null
      - name                   = "blazer" -> null
      - owner_id               = "239043911459" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # aws_ssm_parameter.db_tools_environment_variables will be created
  + resource "aws_ssm_parameter" "db_tools_environment_variables" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "BLAZER_DATABASE_URL"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 7 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>